| Function | Description                                           | Syntax                                      | Example                                     | Output           |
|----------|-------------------------------------------------------|---------------------------------------------|---------------------------------------------|------------------|
| `map()`  | Applies a function to each item in an iterable        | `map(function, iterable)`                   | `map(lambda x: x**2, [1, 2, 3, 4])`         | `[1, 4, 9, 16]`   |
| `filter()` | Filters items in an iterable based on a condition | `filter(function, iterable)`                | `filter(lambda x: x % 2 == 0, [1, 2, 3, 4])` | `[2, 4]`         |
| `lambda` | Anonymous function (short inline function)           | `lambda arguments: expression`              | `lambda x: x + 10`                          | Returns function |

#### Map function

In [13]:
def times2(var):
    return var * 2
times2(10)

20

In [14]:
list_data = [5,6,7,8,9,10]
for data in list_data:
    print(times2(data))

10
12
14
16
18
20

In [15]:
# using map function
mapped_data = map(times2, list_data)
print(type(mapped_data))  # <class 'map'>
print(list(mapped_data))  # [10, 12, 14, 16, 18, 20]
print(type(list(mapped_data)))  # <class 'list'>

<class 'map'>
[10, 12, 14, 16, 18, 20]
<class 'list'>

#### lambda expression

In [16]:
# write down a function in different way
def function1(num):return num * 5
function1(10)

50

In [17]:
t = lambda num: num * 5
t(20)

100

In [18]:
list_data2 = [5,6,7,8,9,10]
print(list(map(lambda num: num * 5, list_data2)))

[25, 30, 35, 40, 45, 50]

#### filter operation

In [19]:
list_data2 = [5,6,7,8,9,10]
print(list(filter(lambda num: num % 2 == 1, list_data2)))
print(list(filter(lambda num: num % 2 == 0, list_data2)))

[5, 7, 9]
[6, 8, 10]

#### dataframe operation using lambda, map, filter

In [20]:
# creating dataframe
import pandas as pd
dict_data = {
    'Data1': [1, 2, 3, 4, 5],
    'Data2': [10, 20, 30, 40, 50],
    'Data3': [100, 200, 300, 400, 500],
}
df = pd.DataFrame(dict_data)
df * 2 # just multiply with 2 and check the result

   Data1  Data2  Data3
0      2     20    200
1      4     40    400
2      6     60    600
3      8     80    800
4     10    100   1000

In [21]:
# extrac single column data or series from dataframe
data1_series = df['Data3']
data1_series

0    100
1    200
2    300
3    400
4    500
Name: Data3, dtype: int64

In [22]:
# using lamda and map function on a sereis of the dataframe by extracting the column data
data4 = list(map(lambda x: x*85, data1_series))
data4

[8500, 17000, 25500, 34000, 42500]

In [23]:
# insert this new data list in the df
df.insert(3, 'Data4', data4)
df

   Data1  Data2  Data3  Data4
0      1     10    100   8500
1      2     20    200  17000
2      3     30    300  25500
3      4     40    400  34000
4      5     50    500  42500

#### filtering data series and prepare a new df

In [24]:
filter_data1 = list(filter(lambda num:num%2 == 0, df['Data1']))
print(filter_data1)
filter_data2 = list(filter(lambda num:num%2 == 0, df['Data2']))
print(filter_data2)
filter_data3 = list(filter(lambda num:num%2 == 0, df['Data3']))
print(filter_data3)
filter_data4 = list(filter(lambda num:num%2 == 0, df['Data4']))
print(filter_data4)

filtered_df = pd.DataFrame({
    #'Data1': filter_data1,
    'Data2': filter_data2,
    'Data3': filter_data3,
    'Data4': filter_data4
})
filtered_df

[2, 4]
[10, 20, 30, 40, 50]
[100, 200, 300, 400, 500]
[8500, 17000, 25500, 34000, 42500]

   Data2  Data3  Data4
0     10    100   8500
1     20    200  17000
2     30    300  25500
3     40    400  34000
4     50    500  42500